#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.2`
* Working Directory 📂`./code/data-management-zone`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazurerm_subnet_network_security_group_association.databricks_private_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet][0m
[0m[1mazurerm_subnet.databricks_public_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet][0m
[0m[1mazurerm_subnet_route_table_association.private_endpoint_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_public_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet][0m
[0m[1mazurerm_subnet.private_endpoint_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.private_endpoint_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet][0m
[0m[1mazurerm_subnet_route_table_association.databricks_private_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet][0m
[0m[1mazurerm_subnet_route_table_association.databricks_public_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mazurerm_subnet.databricks_private_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet][0m
[0m[1mazurerm_resource_group.governance_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg][0m
[0m[1mazurerm_resource_group.unity_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg][0m
[0m[1mazurerm_resource_group.container_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg][0m
[0m[1mazurerm_resource_group.automation_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-automation-rg][0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mazurerm_resource_group.consumption_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mazurerm_purview_account.purview: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mazurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-dbac001][0m
[0m[1mazurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 3s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001][0m
[0m[1mazurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mazurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-automation-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mydmgmt-dev-uai001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 2s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001][0m
[0m[1mazurerm_synapse_private_link_hub.synapse_pl_hub: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 2s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001][0m
[0m[1mazurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-pe][0m
[0m[1mazurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001][0m
[0m[1mazurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mazurerm_private_endpoint.databricks_private_endpoint_web: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-web-pe][0m
[0m[1mazurerm_private_endpoint.synapse_pl_hub_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-pe][0m
[0m[1mazurerm_role_assignment.user_assigned_identity_roleassignment_governance_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001/providers/Microsoft.Authorization/roleAssignments/89f6af3e-8a53-efd9-637b-399011ac936f][0m
[0m[1mdata.azapi_resource.purview: Reading...[0m[0m
[0m[1mazurerm_private_endpoint.purview_private_endpoint_account: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-account-pe][0m
[0m[1mazurerm_private_endpoint.purview_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-portal-pe][0m
[0m[1mazurerm_role_assignment.purview_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/ae3cc160-292e-2d1f-a7b0-d6722db8fb2c][0m
[0m[1mdata.azapi_resource.purview: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001][0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-pe][0m
[0m[1mazurerm_private_endpoint.purview_private_endpoint_queue: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-queue][0m
[0m[1mazurerm_private_endpoint.purview_private_endpoint_namespace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-namespace][0m
[0m[1mazurerm_private_endpoint.purview_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-blob][0m
[0m[1mazapi_resource.datalake_container_unity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/blobServices/default/containers/unitynortheurope][0m
[0m[1mazurerm_role_assignment.databricks_access_connector_roleassignment_datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/providers/Microsoft.Authorization/roleAssignments/db455db8-d5d3-2b43-c364-dd4bcdfe2e07][0m
[0m[1mazurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-dfs-pe][0m
[0m[1mazurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/managementPolicies/default][0m
[0m[1mazurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-blob-pe][0m
[0m[1mdatabricks_metastore.metastore: Refreshing state... [id=9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m
[0m[1mdatabricks_metastore_assignment.metastore_assignment: Refreshing state... [id=100126627990109|9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m
[0m[1mdatabricks_metastore_data_access.metastore_data_access: Refreshing state... [id=9884193e-1edc-4ddd-8e9c-ce570e9cc57a|d76c4804-9485-43bc-b437-bc725f0a85ca][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # azapi_resource.databricks_private_subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "databricks_private_subnet" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.0.16.64/26"
                  [32m+[0m[0m delegations                       = [
                      [32m+[0m[0m {
                          [32m+[0m[0m name       = "DatabricksSubnetDelegation"
                          [32m+[0m[0m properties = {
                              [32m+[0m[0m serviceName = "Microsoft.Databricks/workspaces"
                            }
                        },
                    ]
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "DatabricksPrivateSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azapi_resource.databricks_public_subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "databricks_public_subnet" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.0.16.128/26"
                  [32m+[0m[0m delegations                       = [
                      [32m+[0m[0m {
                          [32m+[0m[0m name       = "DatabricksSubnetDelegation"
                          [32m+[0m[0m properties = {
                              [32m+[0m[0m serviceName = "Microsoft.Databricks/workspaces"
                            }
                        },
                    ]
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "DatabricksPublicSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azapi_resource.private_endpoint_subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "private_endpoint_subnet" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.0.16.0/27"
                  [32m+[0m[0m delegations                       = []
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "ServicesSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azurerm_databricks_workspace.databricks[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_databricks_workspace" "databricks" {
        id                                    = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001"
        name                                  = "mydmgmt-dev-cnsmptn-dbw001"
        tags                                  = {}
        [90m# (13 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m custom_parameters {
          [33m~[0m[0m private_subnet_network_security_group_association_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet" -> (known after apply)
          [33m~[0m[0m public_subnet_network_security_group_association_id  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet" -> (known after apply)
            [90m# (9 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.container_registry_private_endpoint[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "container_registry_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-pe" -> (known after apply)
        name                          = "mydmgmtdevacr001-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/networkInterfaces/mydmgmtdevacr001-nic"
              [31m-[0m[0m name = "mydmgmtdevacr001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-pe/privateDnsZoneGroups/mydmgmtdevacr001-arecord/privateDnsZoneConfigs/privatelink.azurecr.io"
              [31m-[0m[0m name                = "privatelink.azurecr.io"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mydmgmtdevacr001.northeurope.data.privatelink.azurecr.io"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.4",
                        ]
                      [31m-[0m[0m name         = "mydmgmtdevacr001.northeurope.data"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mydmgmtdevacr001.privatelink.azurecr.io"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.5",
                        ]
                      [31m-[0m[0m name         = "mydmgmtdevacr001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-pe/privateDnsZoneGroups/mydmgmtdevacr001-arecord" -> (known after apply)
            name                 = "mydmgmtdevacr001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmtdevacr001-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.4" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.databricks_private_endpoint_ui[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "databricks_private_endpoint_ui" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe" -> (known after apply)
        name                          = "mydmgmt-dev-cnsmptn-dbw001-uiapi-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-cnsmptn-dbw001-uiapi-nic"
              [31m-[0m[0m name = "mydmgmt-dev-cnsmptn-dbw001-uiapi-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-cnsmptn-dbw001-uiapi-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "adb-100126627990109.9.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.11",
                        ]
                      [31m-[0m[0m name         = "adb-100126627990109.9"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-cnsmptn-dbw001-uiapi-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-cnsmptn-dbw001-uiapi-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmt-dev-cnsmptn-dbw001-uiapi-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.11" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.databricks_private_endpoint_web[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "databricks_private_endpoint_web" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-web-pe" -> (known after apply)
        name                          = "mydmgmt-dev-cnsmptn-dbw001-web-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-cnsmptn-dbw001-web-nic"
              [31m-[0m[0m name = "mydmgmt-dev-cnsmptn-dbw001-web-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-web-pe/privateDnsZoneGroups/mydmgmt-dev-cnsmptn-dbw001-web-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.12",
                        ]
                      [31m-[0m[0m name         = "northeurope.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope-c2.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.13",
                        ]
                      [31m-[0m[0m name         = "northeurope-c2.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-web-pe/privateDnsZoneGroups/mydmgmt-dev-cnsmptn-dbw001-web-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-cnsmptn-dbw001-web-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmt-dev-cnsmptn-dbw001-web-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.12" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.datalake_private_endpoint_blob[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "datalake_private_endpoint_blob" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-blob-pe" -> (known after apply)
        name                          = "mydmgmtdevst001-blob-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/networkInterfaces/mydmgmtdevst001-blob-nic"
              [31m-[0m[0m name = "mydmgmtdevst001-blob-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-blob-pe/privateDnsZoneGroups/mydmgmtdevst001-blob-arecord/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              [31m-[0m[0m name                = "privatelink.blob.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mydmgmtdevst001.privatelink.blob.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.6",
                        ]
                      [31m-[0m[0m name         = "mydmgmtdevst001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-blob-pe/privateDnsZoneGroups/mydmgmtdevst001-blob-arecord" -> (known after apply)
            name                 = "mydmgmtdevst001-blob-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmtdevst001-blob-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.6" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.datalake_private_endpoint_dfs[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "datalake_private_endpoint_dfs" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-dfs-pe" -> (known after apply)
        name                          = "mydmgmtdevst001-dfs-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/networkInterfaces/mydmgmtdevst001-dfs-nic"
              [31m-[0m[0m name = "mydmgmtdevst001-dfs-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-dfs-pe/privateDnsZoneGroups/mydmgmtdevst001-dfs-arecord/privateDnsZoneConfigs/privatelink.dfs.core.windows.net"
              [31m-[0m[0m name                = "privatelink.dfs.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mydmgmtdevst001.privatelink.dfs.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.14",
                        ]
                      [31m-[0m[0m name         = "mydmgmtdevst001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-dfs-pe/privateDnsZoneGroups/mydmgmtdevst001-dfs-arecord" -> (known after apply)
            name                 = "mydmgmtdevst001-dfs-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmtdevst001-dfs-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.14" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.key_vault_private_endpoint[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-pe" -> (known after apply)
        name                          = "mydmgmt-dev-kv001-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-kv001-nic"
              [31m-[0m[0m name = "mydmgmt-dev-kv001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-pe/privateDnsZoneGroups/mydmgmt-dev-kv001-arecord/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              [31m-[0m[0m name                = "privatelink.vaultcore.azure.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mydmgmt-dev-kv001.privatelink.vaultcore.azure.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.7",
                        ]
                      [31m-[0m[0m name         = "mydmgmt-dev-kv001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-pe/privateDnsZoneGroups/mydmgmt-dev-kv001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-kv001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmt-dev-kv001-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.7" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.purview_private_endpoint_account[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_account" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-account-pe" -> (known after apply)
        name                          = "mydmgmt-dev-pview001-account-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-pview001-account-nic"
              [31m-[0m[0m name = "mydmgmt-dev-pview001-account-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-account-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-account-arecord/privateDnsZoneConfigs/privatelink.purview.azure.com"
              [31m-[0m[0m name                = "privatelink.purview.azure.com"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mydmgmt-dev-pview001.privatelink.purview.azure.com"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.9",
                        ]
                      [31m-[0m[0m name         = "mydmgmt-dev-pview001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-account-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-account-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-pview001-account-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmt-dev-pview001-account-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.9" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.purview_private_endpoint_blob[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_blob" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-blob" -> (known after apply)
        name                          = "mydmgmt-dev-pview001-pe-blob"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-pview001-blob-nic"
              [31m-[0m[0m name = "mydmgmt-dev-pview001-blob-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-blob/privateDnsZoneGroups/mydmgmt-dev-pview001-blob-arecord/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              [31m-[0m[0m name                = "privatelink.blob.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "scannortheuropekrleqjb.privatelink.blob.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.18",
                        ]
                      [31m-[0m[0m name         = "scannortheuropekrleqjb"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-blob/privateDnsZoneGroups/mydmgmt-dev-pview001-blob-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-pview001-blob-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmt-dev-pview001-blob-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.18" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.purview_private_endpoint_namespace[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_namespace" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-namespace" -> (known after apply)
        name                          = "mydmgmt-dev-pview001-pe-namespace"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-pview001-namespace-nic"
              [31m-[0m[0m name = "mydmgmt-dev-pview001-namespace-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-namespace/privateDnsZoneGroups/mydmgmt-dev-pview001-namespace-arecord/privateDnsZoneConfigs/privatelink.servicebus.windows.net"
              [31m-[0m[0m name                = "privatelink.servicebus.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "Atlas-fe554b9c-3fc3-451d-9d3e-1a2c97dd24bb.privatelink.servicebus.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.17",
                        ]
                      [31m-[0m[0m name         = "Atlas-fe554b9c-3fc3-451d-9d3e-1a2c97dd24bb"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-namespace/privateDnsZoneGroups/mydmgmt-dev-pview001-namespace-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-pview001-namespace-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmt-dev-pview001-namespace-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.17" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.purview_private_endpoint_portal[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_portal" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-portal-pe" -> (known after apply)
        name                          = "mydmgmt-dev-pview001-portal-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-pview001-portal-nic"
              [31m-[0m[0m name = "mydmgmt-dev-pview001-portal-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-portal-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-portal-arecord/privateDnsZoneConfigs/privatelink.purviewstudio.azure.com"
              [31m-[0m[0m name                = "privatelink.purviewstudio.azure.com"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.purviewstudio.azure.com"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "web.privatelink.purviewstudio.azure.com"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.8",
                        ]
                      [31m-[0m[0m name         = "web"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-portal-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-portal-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-pview001-portal-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmt-dev-pview001-portal-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.8" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.purview_private_endpoint_queue[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_queue" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-queue" -> (known after apply)
        name                          = "mydmgmt-dev-pview001-pe-queue"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-pview001-queue-nic"
              [31m-[0m[0m name = "mydmgmt-dev-pview001-queue-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-queue/privateDnsZoneGroups/mydmgmt-dev-pview001-queue-arecord/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              [31m-[0m[0m name                = "privatelink.queue.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "scannortheuropekrleqjb.privatelink.queue.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.16",
                        ]
                      [31m-[0m[0m name         = "scannortheuropekrleqjb"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-queue/privateDnsZoneGroups/mydmgmt-dev-pview001-queue-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-pview001-queue-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmt-dev-pview001-queue-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.16" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.synapse_pl_hub_private_endpoint[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "synapse_pl_hub_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-pe" -> (known after apply)
        name                          = "mydmgmtdevsynplh001-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/networkInterfaces/mydmgmtdevsynplh001-nic"
              [31m-[0m[0m name = "mydmgmtdevsynplh001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-pe/privateDnsZoneGroups/mydmgmtdevsynplh001-arecord/privateDnsZoneConfigs/privatelink.azuresynapse.net"
              [31m-[0m[0m name                = "privatelink.azuresynapse.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "web.privatelink.azuresynapse.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.16.10",
                        ]
                      [31m-[0m[0m name         = "web"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [31m# forces replacement[0m[0m -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-pe/privateDnsZoneGroups/mydmgmtdevsynplh001-arecord" -> (known after apply)
            name                 = "mydmgmtdevsynplh001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "mydmgmtdevsynplh001-pe"
          [33m~[0m[0m private_ip_address             = "10.0.16.10" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_subnet.databricks_private_subnet[0m will be [1m[31mdestroyed[0m
  # (because azurerm_subnet.databricks_private_subnet is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_subnet" "databricks_private_subnet" {
      [31m-[0m[0m address_prefixes                               = [
          [31m-[0m[0m "10.0.16.64/26",
        ] [90m-> null[0m[0m
      [31m-[0m[0m enforce_private_link_endpoint_network_policies = false [90m-> null[0m[0m
      [31m-[0m[0m enforce_private_link_service_network_policies  = false [90m-> null[0m[0m
      [31m-[0m[0m id                                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet" [90m-> null[0m[0m
      [31m-[0m[0m name                                           = "DatabricksPrivateSubnet" [90m-> null[0m[0m
      [31m-[0m[0m private_endpoint_network_policies_enabled      = true [90m-> null[0m[0m
      [31m-[0m[0m private_link_service_network_policies_enabled  = true [90m-> null[0m[0m
      [31m-[0m[0m resource_group_name                            = "mycrp-prd-dmgmt-network-rg" [90m-> null[0m[0m
      [31m-[0m[0m service_endpoint_policy_ids                    = [] [90m-> null[0m[0m
      [31m-[0m[0m service_endpoints                              = [] [90m-> null[0m[0m
      [31m-[0m[0m virtual_network_name                           = "mycrp-prd-dmgmt-vnet001" [90m-> null[0m[0m

      [31m-[0m[0m delegation {
          [31m-[0m[0m name = "DatabricksSubnetDelegation" [90m-> null[0m[0m

          [31m-[0m[0m service_delegation {
              [31m-[0m[0m actions = [
                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ] [90m-> null[0m[0m
              [31m-[0m[0m name    = "Microsoft.Databricks/workspaces" [90m-> null[0m[0m
            }
        }
    }

[1m  # azurerm_subnet.databricks_public_subnet[0m will be [1m[31mdestroyed[0m
  # (because azurerm_subnet.databricks_public_subnet is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_subnet" "databricks_public_subnet" {
      [31m-[0m[0m address_prefixes                               = [
          [31m-[0m[0m "10.0.16.128/26",
        ] [90m-> null[0m[0m
      [31m-[0m[0m enforce_private_link_endpoint_network_policies = false [90m-> null[0m[0m
      [31m-[0m[0m enforce_private_link_service_network_policies  = false [90m-> null[0m[0m
      [31m-[0m[0m id                                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet" [90m-> null[0m[0m
      [31m-[0m[0m name                                           = "DatabricksPublicSubnet" [90m-> null[0m[0m
      [31m-[0m[0m private_endpoint_network_policies_enabled      = true [90m-> null[0m[0m
      [31m-[0m[0m private_link_service_network_policies_enabled  = true [90m-> null[0m[0m
      [31m-[0m[0m resource_group_name                            = "mycrp-prd-dmgmt-network-rg" [90m-> null[0m[0m
      [31m-[0m[0m service_endpoint_policy_ids                    = [] [90m-> null[0m[0m
      [31m-[0m[0m service_endpoints                              = [] [90m-> null[0m[0m
      [31m-[0m[0m virtual_network_name                           = "mycrp-prd-dmgmt-vnet001" [90m-> null[0m[0m

      [31m-[0m[0m delegation {
          [31m-[0m[0m name = "DatabricksSubnetDelegation" [90m-> null[0m[0m

          [31m-[0m[0m service_delegation {
              [31m-[0m[0m actions = [
                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ] [90m-> null[0m[0m
              [31m-[0m[0m name    = "Microsoft.Databricks/workspaces" [90m-> null[0m[0m
            }
        }
    }

[1m  # azurerm_subnet.private_endpoint_subnet[0m will be [1m[31mdestroyed[0m
  # (because azurerm_subnet.private_endpoint_subnet is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_subnet" "private_endpoint_subnet" {
      [31m-[0m[0m address_prefixes                               = [
          [31m-[0m[0m "10.0.16.0/27",
        ] [90m-> null[0m[0m
      [31m-[0m[0m enforce_private_link_endpoint_network_policies = false [90m-> null[0m[0m
      [31m-[0m[0m enforce_private_link_service_network_policies  = false [90m-> null[0m[0m
      [31m-[0m[0m id                                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [90m-> null[0m[0m
      [31m-[0m[0m name                                           = "ServicesSubnet" [90m-> null[0m[0m
      [31m-[0m[0m private_endpoint_network_policies_enabled      = true [90m-> null[0m[0m
      [31m-[0m[0m private_link_service_network_policies_enabled  = true [90m-> null[0m[0m
      [31m-[0m[0m resource_group_name                            = "mycrp-prd-dmgmt-network-rg" [90m-> null[0m[0m
      [31m-[0m[0m service_endpoint_policy_ids                    = [] [90m-> null[0m[0m
      [31m-[0m[0m service_endpoints                              = [] [90m-> null[0m[0m
      [31m-[0m[0m virtual_network_name                           = "mycrp-prd-dmgmt-vnet001" [90m-> null[0m[0m
    }

[1m  # azurerm_subnet_network_security_group_association.databricks_private_subnet_nsg[0m will be [1m[31mdestroyed[0m
  # (because azurerm_subnet_network_security_group_association.databricks_private_subnet_nsg is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_subnet_network_security_group_association" "databricks_private_subnet_nsg" {
      [31m-[0m[0m id                        = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet" [90m-> null[0m[0m
      [31m-[0m[0m network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001" [90m-> null[0m[0m
      [31m-[0m[0m subnet_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet" [90m-> null[0m[0m
    }

[1m  # azurerm_subnet_network_security_group_association.databricks_public_subnet_nsg[0m will be [1m[31mdestroyed[0m
  # (because azurerm_subnet_network_security_group_association.databricks_public_subnet_nsg is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_subnet_network_security_group_association" "databricks_public_subnet_nsg" {
      [31m-[0m[0m id                        = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet" [90m-> null[0m[0m
      [31m-[0m[0m network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001" [90m-> null[0m[0m
      [31m-[0m[0m subnet_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet" [90m-> null[0m[0m
    }

[1m  # azurerm_subnet_network_security_group_association.private_endpoint_subnet_nsg[0m will be [1m[31mdestroyed[0m
  # (because azurerm_subnet_network_security_group_association.private_endpoint_subnet_nsg is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_subnet_network_security_group_association" "private_endpoint_subnet_nsg" {
      [31m-[0m[0m id                        = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [90m-> null[0m[0m
      [31m-[0m[0m network_security_group_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001" [90m-> null[0m[0m
      [31m-[0m[0m subnet_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [90m-> null[0m[0m
    }

[1m  # azurerm_subnet_route_table_association.databricks_private_subnet_routetable[0m will be [1m[31mdestroyed[0m
  # (because azurerm_subnet_route_table_association.databricks_private_subnet_routetable is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_subnet_route_table_association" "databricks_private_subnet_routetable" {
      [31m-[0m[0m id             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet" [90m-> null[0m[0m
      [31m-[0m[0m route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001" [90m-> null[0m[0m
      [31m-[0m[0m subnet_id      = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet" [90m-> null[0m[0m
    }

[1m  # azurerm_subnet_route_table_association.databricks_public_subnet_routetable[0m will be [1m[31mdestroyed[0m
  # (because azurerm_subnet_route_table_association.databricks_public_subnet_routetable is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_subnet_route_table_association" "databricks_public_subnet_routetable" {
      [31m-[0m[0m id             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet" [90m-> null[0m[0m
      [31m-[0m[0m route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001" [90m-> null[0m[0m
      [31m-[0m[0m subnet_id      = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet" [90m-> null[0m[0m
    }

[1m  # azurerm_subnet_route_table_association.private_endpoint_subnet_routetable[0m will be [1m[31mdestroyed[0m
  # (because azurerm_subnet_route_table_association.private_endpoint_subnet_routetable is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_subnet_route_table_association" "private_endpoint_subnet_routetable" {
      [31m-[0m[0m id             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [90m-> null[0m[0m
      [31m-[0m[0m route_table_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001" [90m-> null[0m[0m
      [31m-[0m[0m subnet_id      = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet" [90m-> null[0m[0m
    }

[1mPlan:[0m 15 to add, 1 to change, 21 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>